BrioWuShockTube/BWShockTube_3/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    inlet
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          1;
        startFace       99;
    }
    outlet
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          1;
        startFace       100;
    }
    lowerWall
    {
        type            empty;
        inGroups        List<word> 1(empty);
        nFaces          100;
        startFace       101;
    }
    upperWall
    {
        type            empty;
        inGroups        List<word> 1(empty);
        nFaces          100;
        startFace       201;
    }
    frontAndBack
    {
        type            empty;
        inGroups        List<word> 1(empty);
        nFaces          200;
        startFace       301;
    }
)

// ************************************************************************* //
