BrioWuShockTube/BWShockTube_3/system/setFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

defaultFieldValues
(
	volVectorFieldValue U (0 0 0)
	volScalarFieldValue T 0.00348432
	volScalarFieldValue p 1
	volVectorFieldValue B (0.75 1 0)
);

regions
(
	boxToCell
	{
		box (0 -1 -1) (1 1 1);
		fieldValues
		(
			volScalarFieldValue T 0.00278746
			volScalarFieldValue p 0.1
			volVectorFieldValue B (0.75 -1 0)
		);
	}
);


// ************************************************************************* //
